tap "homebrew/bundle"

# ── Shell ──────────────────────────────────────────────────────────────
brew "fish"

# ── Prompt ─────────────────────────────────────────────────────────────
brew "starship"

# ── Tools ──────────────────────────────────────────────────────────────
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "atuin"
brew "direnv"

# ── Git ────────────────────────────────────────────────────────────────
brew "git-delta"
brew "gh"
brew "lazygit"

# ── Languages ──────────────────────────────────────────────────────────
brew "uv"
brew "fnm"

# ── Terminal ───────────────────────────────────────────────────────────
brew "zellij"
