# ── Shell ──────────────────────────────────────────────────────────────
brew "fish"
brew "nushell"

# ── Prompt ─────────────────────────────────────────────────────────────
brew "starship"

# ── Tools ──────────────────────────────────────────────────────────────
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "atuin"
brew "direnv"
brew "less"

# ── Git ────────────────────────────────────────────────────────────────
brew "git-delta"
brew "gh"
brew "lazygit"

# ── Languages ──────────────────────────────────────────────────────────
brew "uv"
brew "fnm"
tap "oven-sh/bun"
brew "bun"
brew "rustup"

# ── Terminal ───────────────────────────────────────────────────────────
brew "zellij"
brew "tmux"


# AI
tap "Gentleman-Programming/homebrew-tap"
brew "gentle-ai"
brew "gga"
brew "engram"

brew "anomalyco/tap/opencode"
