jorgebucaran/fisher
jethrokuan/z
jethrokuan/fzf
jorgebucaran/fnm
eth-p/fish-plugin-sudo
jhillyerd/plugin-git
jorgebucaran/autopair.fish
patrickf1/fzf.fish
